jamesath3d/msp430-examples/32_adc/voltage_monitor_with_a_timestamp_adc.c
/* --COPYRIGHT--,BSD-3-Clause
 * Copyright (c) 2020, Texas Instruments Incorporated
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 * --/COPYRIGHT--*/
//******************************************************************************
//  Voltage Monitor with a Timestamp
//
//  Description: A voltage monitor based on the ADC window comparator with
//               internal 1.5V reference. Timer1_A3 is used as an interval timer
//               used to trigger the ADC samples. The MSP430 uses the RTC
//               counter module to increment the timestamp and toggle LED1 every
//               1 second. Use the UART to set an initial time after startup and
//               the RTC will increment from there. The timestamp is in the
//               POSIX time format. The timestamp can be read out over UART by
//               a host microcontroller or processor, so the MSP430 is
//               functioning as an external RTC to keep time. If the input
//               voltage on the ADC input is higher or lower than the window
//               comparator thresholds, that timestamp will be stored in FRAM,
//               so it will be retained through a power loss. Both window
//               comparator thresholds can be read out and changed over UART.
//
//  --------------------------------------------------------------------------
//  UART Communication Protocol
//  --------------------------------------------------------------------------
//  [COMMAND] <data> <data> <data> <data>
//
//  COMMANDS:                                     RESPONSES:
//  RTC_READ_TIME =      00h                      00h XXh XXh XXh XXh
//  RTC_WRITE_TIME =     01h XXh XXh XXh XXh
//  RTC_READ_THR_HIGH =  02h                      02h XXh XXh XXh XXh
//  RTC_READ_THR_LOW =   03h                      03h XXh XXh XXh XXh
//  ADC_READ_THR_HIGH =  04h                      04h XXh XXh
//  ADC_READ_THR_LOW =   05h                      05h XXh XXh
//  ADC_WRITE_THR_HIGH = 06h XXh XXh
//  ADC_WRITE_THR_LOW =  07h XXh XXh
//
//  --------------------------------------------------------------------------
//  Clock configuration
//  --------------------------------------------------------------------------
//  ACLK = default REFO ~32768Hz, SMCLK = MCLK = 16MHz
//
//  At this speed, the FRAM requires wait states. FLL reference clock is REFO.
//  XT1 can be used for ACLK if crystal selection resistors on LaunchPad are
//  changed and __ENABLE_XT1__ is added to Predefined Symbols in the compiler
//  settings.
//
//  --------------------------------------------------------------------------
//
//           MSP430FR2433
//         ---------------
//     /|\|           P1.0|---> LED1
//      | |               |
//      --| RST    P1.1/A1|<--- Voltage monitoring
//        |               |
//        |   P1.4/UCA0TXD|---> PC
//        |   P1.5/UCA0RXD|<--- PC
//        |               |
//
//
//  James Evans
//  Texas Instruments Inc.
//  October 2020
//  Built with Code Composer Studio v10.1 and IAR Embedded Workbench v7.12.2
//******************************************************************************

// #includes for header files
#include <msp430.h>
#include <stdint.h>

// #defines for communication protocol commands
#define RTC_READ_TIME        0      // Reads current timestamp
#define RTC_WRITE_TIME       1      // Sets new timestamp
#define RTC_READ_THR_HIGH    2      // Reads latest high threshold timestamp
#define RTC_READ_THR_LOW     3      // Reads latest low threshold timestamp
#define ADC_READ_THR_HIGH    4      // Reads current high threshold value
#define ADC_READ_THR_LOW     5      // Reads current low threshold value
#define ADC_WRITE_THR_HIGH   6      // Sets new high threshold value
#define ADC_WRITE_THR_LOW    7      // Sets new low threshold value

// #defines for initial window comparator voltage thresholds
#define ADC_THR_HIGH_MAX     1023   // Maximum high threshold
#define ADC_THR_HIGH_INIT    818    // (818 / 1023) x VREF = ~1.2V, VREF = 1.5V
#define ADC_THR_LOW_INIT     682    // (682 / 1023) x VREF = ~1.0V, VREF = 1.5V

// Data to be stored in FRAM and retained through power loss
// timeStamp values are in POSIX time format (# of seconds since midnight 1 Jan. 1970)
// User needs to set the starting time with the RTC_WRITE_TIME command
// (01h XXh XXh XXh XXh)
// RTC_READ_TIME command is answered by echoing command and sending timeStamp, LSB first (timeStamp[0])
// (00h XXh XXh XXh XXh)
#ifdef __TI_COMPILER_VERSION__
#pragma PERSISTENT (timeStampThrHighFRAM)
#pragma PERSISTENT (timeStampThrLowFRAM)
uint8_t timeStampThrHighFRAM[4] = {0};
uint8_t timeStampThrLowFRAM[4] = {0};
#elif __IAR_SYSTEMS_ICC__
__persistent uint8_t timeStampThrHighFRAM[4] = {0};
__persistent uint8_t timeStampThrLowFRAM[4] = {0};
#else
#error Compiler not supported!
#endif

// Global variables
volatile uint8_t command, data, byteCount, sendTimeStampThrHigh, sendTimeStampThrLow;
volatile uint8_t timeStamp[4] = {0};
volatile uint8_t voltageThr[2] = {0};
volatile uint16_t voltageThrHigh, voltageThrLow, voltageThrNew;

// Function prototypes
void GPIO_Init();
void ADC_Disable();
void ADC_Configure(uint16_t hiThr, uint16_t loThr);
void ADC_Enable();
void UART_sendByte(uint8_t txByte);

/**
 * main.c
 */
int main(void)
{
    WDTCTL = WDTPW | WDTHOLD;              // Stop watchdog timer

    // Initialize variables
    byteCount = 0;                         // Clear byteCount
    voltageThrHigh = ADC_THR_HIGH_INIT;    // Set initial window comparator high threshold
    voltageThrLow = ADC_THR_LOW_INIT;      // Set initial window comparator low threshold

    // Configure pin functions
    P1SEL0 |= BIT4 | BIT5;                 // UCA0 TXD, RXD
    SYSCFG2 |= ADCPCTL1;                   // ADC A1

    // Initialize pins
    GPIO_Init();

#ifdef __ENABLE_XT1__
    // Configure XT1
    P2SEL0 |= BIT0 | BIT1;                 // Set XT1 pins as second function
    do
    {
        CSCTL7 &= ~(XT1OFFG | DCOFFG);     // Clear XT1 and DCO fault flags
        SFRIFG1 &= ~OFIFG;
    }while (SFRIFG1 & OFIFG);              // Test oscillator fault flag
#endif

    // Disable the GPIO power-on default high-impedance mode to activate
    // previously configured port settings
    PM5CTL0 &= ~LOCKLPM5;

    // Configure one FRAM waitstate as required by the device datasheet for MCLK
    // operation beyond 8MHz _before_ configuring the clock system
    FRCTL0 = FRCTLPW | NWAITS_1;

    // Configure MCLK for 16MHz operation
    __bis_SR_register(SCG0);                      // Disable FLL
    CSCTL3 |= SELREF__REFOCLK;                    // Set REFO as FLL reference source
    CSCTL0 = 0;                                   // clear DCO and MOD registers
    CSCTL1 &= ~(DCORSEL_7);                       // Clear DCO frequency select bits first
    CSCTL1 |= DCORSEL_5;                          // Set DCO = 16MHz
    CSCTL2 = FLLD_0 + 487;                        // DCOCLKDIV = 16MHz
    __delay_cycles(3);
    __bic_SR_register(SCG0);                      // Enable FLL
    while(CSCTL7 & (FLLUNLOCK0 | FLLUNLOCK1));    // Delay until FLL has locked
#ifdef __ENABLE_XT1__
    CSCTL4 = SELMS__DCOCLKDIV | SELA__XT1CLK;     // Set default DCOCLKDIV as MCLK and SMCLK source;
                                                  // Set XT1 (~32768Hz) as ACLK source
#else
    CSCTL4 = SELMS__DCOCLKDIV | SELA__REFOCLK;    // Set default DCOCLKDIV as MCLK and SMCLK source;
#endif                                            // Set default REFO (~32768Hz) as ACLK source

    // Configure UART
    // Refer to Typical Baud Rates Table in User's Guide, 9600 baud at BRCLK = 16000000Hz
    // UCOS16 = 1
    // UCBRx = 104
    // UCBRFx = 2
    // UCBRSx = 0xD6
    UCA0CTLW0 = UCSWRST | UCSSEL__SMCLK;          // Reset eUSCI; BRCLK = SMCLK
    UCA0BRW = 104;
    UCA0MCTLW = 0xD600 | UCBRF_2 | UCOS16;
    UCA0CTLW0 &= ~UCSWRST;                        // Initialize eUSCI
    UCA0IE = UCRXIE;                              // Enable USCI_A0 RX interrupt

