jamesath3d/msp430-examples/32_adc/voltage_monitor_with_a_timestamp_adc.c
    // Configure RTC
#ifdef __ENABLE_XT1__
    RTCMOD = 32768-1;                             // RTC count re-load compare value at XT1CLK for ~1s interrupt
    RTCCTL = RTCSS__XT1CLK | RTCSR |              // Clock source = XT1CLK; Real-time software reset
            RTCPS__1 | RTCIE;                     // Pre-divide by 1 (default); Enable RTC interrupts
#else
    RTCMOD = 16000-1;                             // RTC count re-load compare value at SMCLK/1000 for ~1s interrupt
    RTCCTL = RTCSS__SMCLK | RTCSR |               // Clock source = SMCLK; Real-time software reset
             RTCPS__1000 | RTCIE;                 // Pre-divide by 1000; Enable RTC interrupts
#endif

    // Configure internal reference (1.5V)
    PMMCTL0_H = PMMPW_H;                          // Unlock PMM registers
    PMMCTL2 |= INTREFEN;                          // Enable internal reference
    while(!(PMMCTL2 & REFGENRDY));                // Delay until internal reference has settled

    // Configure ADC window comparator
    ADC_Disable();                                // Disable ADC
    ADC_Configure(voltageThrHigh, voltageThrLow); // Configure ADC

    // Configure ADC timer trigger TA1.1
    TA1CCR0 = 16384-1;                            // PWM period = 16384/32768 = ~0.5s
    TA1CCR1 = 8192-1;                             // TA1.1 duty cycle = ~50%
    TA1CCTL1 = OUTMOD_3;                          // TA1CCR1 set/reset mode
    TA1CTL = TASSEL__ACLK | MC_1 | TACLR;         // Clock source = ACLK; Up mode; Clear counter
    ADC_Enable();                                 // Enable ADC

    // Communication state machine
    while(1)
    {
        __bis_SR_register(LPM0_bits | GIE);       // Enter LPM0, enable interrupts
        __no_operation();                         // For debugger only

        // 1st byte received (command byte)
        if(byteCount == 1)
        {
            command = data;                       // Store command byte
            
			// RTC_READ_TIME command
            if(command == RTC_READ_TIME)
            {
                // Send current timestamp
                UART_sendByte(RTC_READ_TIME);     // Echo command byte
                UART_sendByte(timeStamp[0]);      // LSB to MSB
                UART_sendByte(timeStamp[1]);
                UART_sendByte(timeStamp[2]);
                UART_sendByte(timeStamp[3]);
                byteCount = 0;                    // No further bytes to receive for this command
            }

            // RTC_READ_THR_HIGH command
            else if(command == RTC_READ_THR_HIGH)
            {
                // Send timestamp for window comparator high threshold
                UART_sendByte(RTC_READ_THR_HIGH);               // Echo command byte
                UART_sendByte(timeStampThrHighFRAM[0]);         // LSB to MSB
                UART_sendByte(timeStampThrHighFRAM[1]);
                UART_sendByte(timeStampThrHighFRAM[2]);
                UART_sendByte(timeStampThrHighFRAM[3]);
                byteCount = 0;                                  // No further bytes to receive for this command
            }

            // RTC_READ_THR_LOW command
            else if(command == RTC_READ_THR_LOW)
            {
                // Send timestamp for window comparator low threshold
                UART_sendByte(RTC_READ_THR_LOW);                // Echo command byte
                UART_sendByte(timeStampThrLowFRAM[0]);          // LSB to MSB
                UART_sendByte(timeStampThrLowFRAM[1]);
                UART_sendByte(timeStampThrLowFRAM[2]);
                UART_sendByte(timeStampThrLowFRAM[3]);
                byteCount = 0;                                  // No further bytes to receive for this command
            }

            // ADC_READ_THR_HIGH command
            else if(command == ADC_READ_THR_HIGH)
            {
                // Send existing window comparator high threshold
                UART_sendByte(ADC_READ_THR_HIGH);               // Echo command byte
                UART_sendByte(voltageThrHigh & 0xFF);           // LSB to MSB
                UART_sendByte(voltageThrHigh >> 8);
                byteCount = 0;                                  // No further bytes to receive for this command
            }

            // ADC_READ_THR_LOW command
            else if(command == ADC_READ_THR_LOW)
            {
                // Send existing window comparator low threshold
                UART_sendByte(ADC_READ_THR_LOW);                // Echo command byte
                UART_sendByte(voltageThrLow & 0xFF);            // LSB to MSB
                UART_sendByte(voltageThrLow >> 8);
                byteCount = 0;                                  // No further bytes to receive for this command
            }

            // Error handler for unsupported commands
            else if(command > ADC_WRITE_THR_LOW)
            {
                byteCount = 0;                                  // No further bytes to receive for this command
            }
        }

        // 2nd through 5th byte received (data bytes)
        else if((byteCount >= 2) && (byteCount <= 5))
        {
            // RTC_WRITE_TIME command
            if(command == RTC_WRITE_TIME)
            {
                // Update timestamp
                timeStamp[byteCount - 2] = data;                // LSB to MSB
                if(byteCount == 5)
                {
                    byteCount = 0;                              // No further bytes to receive for this command
                }
            }

            // ADC_WRITE_THR_HIGH command
            else if(command == ADC_WRITE_THR_HIGH)
            {
                // Receive new window comparator high threshold
                voltageThr[byteCount - 2] = data;               // LSB to MSB
                if(byteCount == 3)
                {
                    voltageThrNew = (voltageThr[1] << 8) | (voltageThr[0]);     // Concatenate the two bytes
                    
					// Check if new high threshold exceeds max value
                    if(voltageThrNew > ADC_THR_HIGH_MAX)
                    {
                        voltageThrHigh = ADC_THR_HIGH_MAX;                      // If so, limit high threshold to max value
                    }

                    // Make sure new high threshold is greater than low threshold
                    else if(voltageThrNew > voltageThrLow)
                    {
                        voltageThrHigh = voltageThrNew;                         // If so, update high threshold

                        // Re-configure ADC window comparator
                        ADC_Disable();                                          // Disable ADC
                        ADC_Configure(voltageThrHigh, voltageThrLow);           // Apply new threshold
                        ADC_Enable();                                           // Enable ADC
                    }
                    byteCount = 0;                                              // No further bytes to receive for this command
                }
            }

            // ADC_WRITE_THR_LOW command
            else if(command == ADC_WRITE_THR_LOW)
            {
                // Receive new window comparator low threshold
                voltageThr[byteCount - 2] = data;                               // LSB to MSB
                if(byteCount == 3)
                {
                    voltageThrNew = (voltageThr[1] << 8) | (voltageThr[0]);     // Concatenate the two bytes
                    
					// Make sure new low threshold is less than high threshold
                    if(voltageThrNew < voltageThrHigh)
                    {
                        voltageThrLow = voltageThrNew;                          // If so, update low threshold

                        // Re-configure ADC window comparator
                        ADC_Disable();                                          // Disable ADC
                        ADC_Configure(voltageThrHigh, voltageThrLow);           // Apply new threshold
                        ADC_Enable();                                           // Enable ADC
                    }
                    byteCount = 0;                                              // No further bytes to receive for this command
                }
            }
        }

        else
        {
            // Automatically send timestamps when window comparator thresholds are exceeded
            if(sendTimeStampThrHigh == 1)
            {
                // Send latest timestamp for high threshold
                UART_sendByte(RTC_READ_THR_HIGH);               // Send command byte
                UART_sendByte(timeStampThrHighFRAM[0]);         // LSB to MSB
                UART_sendByte(timeStampThrHighFRAM[1]);
                UART_sendByte(timeStampThrHighFRAM[2]);
                UART_sendByte(timeStampThrHighFRAM[3]);
                sendTimeStampThrHigh = 0;                       // Clear flag
            }
            else if(sendTimeStampThrLow == 1)
            {
                // Send latest timestamp for low threshold
                UART_sendByte(RTC_READ_THR_LOW);                // Send command byte
                UART_sendByte(timeStampThrLowFRAM[0]);          // LSB to MSB
                UART_sendByte(timeStampThrLowFRAM[1]);
                UART_sendByte(timeStampThrLowFRAM[2]);
                UART_sendByte(timeStampThrLowFRAM[3]);
                sendTimeStampThrLow = 0;                        // Clear flag
            }
        }
    }
}

