jamesath3d/msp430-examples/32_adc/voltage_monitor_with_a_timestamp_adc.c
// Function for configuring GPIOs
void GPIO_Init()
{
    P1DIR = 0xFF; P2DIR = 0xFF; P3DIR = 0xFF;
    P1REN = 0xFF; P2REN = 0xFF; P3REN = 0xFF;
    P1OUT = 0x00; P2OUT = 0x00; P3OUT = 0x00;
}

// Function for disabling ADC
void ADC_Disable()
{
    ADCCTL0 &= ~ADCENC;                           // Disable ADC conversions
}

// Function for configuring ADC and setting window comparator thresholds
void ADC_Configure(uint16_t hiThr, uint16_t loThr)
{
    ADCCTL0 = ADCSHT_2 | ADCON;                   // 16 ADCCLK cycles; Enable ADC core
    ADCCTL1 = ADCSHP | ADCSHS_2 |                 // Pulse sample mode; TA1.1 trigger
    ADCCONSEQ_2 |                                 // Repeat-single-channel mode
    ADCSSEL_1 | ADCDIV_0;                         // ADCCLK = ACLK; Divide by 1
    ADCCTL2 = ADCRES_1;                           // 10-bit conversion result resolution
    ADCMCTL0 = ADCINCH_1 | ADCSREF_1;             // ADC A1 channel; V(R+) = 1.5V VREF, V(R-) = AVSS
    ADCHI = hiThr;                                // Set window comparator high threshold
    ADCLO = loThr;                                // Set window comparator low threshold
    ADCIE |= ADCHIIE | ADCLOIE | ADCINIE;         // Enable ADCHI, ADCLO, ADCIN interrupts
}

// Function for enabling ADC
void ADC_Enable()
{
    ADCCTL0 |= ADCENC;                            // Enable ADC conversions
}

// Function for sending UART byte via polling method
void UART_sendByte(uint8_t txByte)
{
    while(!(UCA0IFG & UCTXIFG));                  // Check if ready to TX
    UCA0TXBUF = txByte;                           // Send the data byte
}

// UART interrupt service routine
#ifndef __ENABLE_GUI__
#if defined(__TI_COMPILER_VERSION__) || defined(__IAR_SYSTEMS_ICC__)
#pragma vector=USCI_A0_VECTOR
__interrupt void USCI_A0_ISR(void)
#elif defined(__GNUC__)
void __attribute__ ((interrupt(USCI_A0_VECTOR))) USCI_A0_ISR (void)
#else
#error Compiler not supported!
#endif
{
    switch(__even_in_range(UCA0IV,USCI_UART_UCTXCPTIFG))
    {
        case USCI_NONE: break;
        case USCI_UART_UCRXIFG:                   // Receive interrupt
            data = UCA0RXBUF;                     // Read received byte
            byteCount++;                          // Increment byte
            __bic_SR_register_on_exit(LPM0_bits); // Wake from LPM
            break;
        case USCI_UART_UCTXIFG: break;
        case USCI_UART_UCSTTIFG: break;
        case USCI_UART_UCTXCPTIFG: break;
        default: break;
    }
}
#endif

// RTC interrupt service routine
#if defined(__TI_COMPILER_VERSION__) || defined(__IAR_SYSTEMS_ICC__)
#pragma vector=RTC_VECTOR
__interrupt void RTC_ISR(void)
#elif defined(__GNUC__)
void __attribute__ ((interrupt(RTC_VECTOR))) RTC_ISR (void)
#else
#error Compiler not supported!
#endif
{
    switch(__even_in_range(RTCIV,RTCIV_RTCIF))
    {
        case  RTCIV_NONE:   break;                // No interrupt
        case  RTCIV_RTCIF:                        // RTC Overflow
            P1OUT ^= BIT0;                        // Toggle LED1
            (*(uint32_t*)timeStamp)++;            // Increment timestamp
            break;
        default: break;
    }
}

// ADC interrupt service routine
#if defined(__TI_COMPILER_VERSION__) || defined(__IAR_SYSTEMS_ICC__)
#pragma vector=ADC_VECTOR
__interrupt void ADC_ISR(void)
#elif defined(__GNUC__)
void __attribute__ ((interrupt(ADC_VECTOR))) ADC_ISR (void)
#else
#error Compiler not supported!
#endif
{
    switch(__even_in_range(ADCIV,ADCIV_ADCIFG))
    {
        case ADCIV_NONE:
            break;
        case ADCIV_ADCOVIFG:
            break;
        case ADCIV_ADCTOVIFG:
            break;
        case ADCIV_ADCHIIFG:                                            // ADCHI; ADC result > ADCTHRHIGH
            ADCIFG &= ~ADCHIIFG;                                        // Clear interrupt flag
            SYSCFG0 = FRWPPW;                                           // Open FRAM for writes to timeStampThrHighFRAM
            *(uint32_t*)timeStampThrHighFRAM = *(uint32_t*)timeStamp;   // Store timestamp in FRAM
            SYSCFG0 = FRWPPW | PFWP;                                    // FRAM write protected (not writable)
            sendTimeStampThrHigh = 1;                                   // Set flag to send timestamp over UART
            __bic_SR_register_on_exit(LPM0_bits);                       // Wake from LPM to send timestamp
            break;
        case ADCIV_ADCLOIFG:                                            // ADCLO; ADC result < ADCTHRLOW
            ADCIFG &= ~ADCLOIFG;                                        // Clear interrupt flag
            SYSCFG0 = FRWPPW;                                           // Open FRAM for writes to timeStampThrLowFRAM
            *(uint32_t*)timeStampThrLowFRAM = *(uint32_t*)timeStamp;    // Store timestamp in FRAM
            SYSCFG0 = FRWPPW | PFWP;                                    // FRAM write protected (not writable)
            sendTimeStampThrLow = 1;                                    // Set flag to send timestamp over UART
            __bic_SR_register_on_exit(LPM0_bits);                       // Wake from LPM to send timestamp
            break;
        case ADCIV_ADCINIFG:                                            // ADCIN; ADCTHRLOW < ADC result < ADCTHRHIGH
            ADCIFG &= ~ADCINIFG;                                        // Clear interrupt flag
            break;
        case ADCIV_ADCIFG:
            break;
        default:
            break;
    }
}
